[{"autor": "Конфуций",
  "qoute": "Я не просвещаю тех, кто не жаждет учиться, и не побуждаю тех, кто не хочет искать ответы самостоятельно. Если я покажу один угол квадрата, и они не приходят ко мне с остальными тремя - мне не нужно давать повторных объяснений."
  },
  {"autor": "Дональд Кнут",
   "qoute": "Люди считают, что компьютерные науки - это искусство для гениев. В реальности всё наоборот - просто множество людей делают вещи, которые стоят друг на друге, будто составляя стену из маленьких камушков."
  },
  {"autor": "Мастер Юан-Ма",
   "qoute": "Начинающий программист пишет программы так, как муравьи строят муравейник - по кусочку, без размышления над общей структурой. Его программы как песок. Они могут недолго простоять, но вырастая, они разваливаются. Поняв проблему, программист тратит много времени на размышления о структуре. Его программы получабтся жёстко структурированными, как каменные изваяния. Они тверды, но когда их нужно менять, над ними приходится совершать насилие. Мастер-программист знает, когда нужна структура, а когда нужно оставить вещи в простом виде. Его программы словно глина - твёрдые, но податливые."
  },
  {"autor": "М.К. Эшер",
   "qoute": "Рисование - это обман."
  },
  {"autor": "Брайан Керниган и П.Ж. Плауэр",
   "qoute": "Отладка изначально вдвое сложнее написания кода. Поэтому, если вы пишите код настолько заумный, насколько можете, то по определению вы не способны отлаживать его."
  },
  {"autor": "Мастер Юан-Ма",
   "qoute": "Юан-Ма написал небольшую программу, использующую много глобальных переменных и ужасных хаков. Учение, читая программу, спросил его: 'Вы предупреждали нас о подобных техниках, но при этом я нахожу их в вашей же программе. Как это возможно?' Мастер ответил: 'Не нужно бежать за поливальным шлангом, если дом не горит'."
  },
  {"autor": "Марк Аврелий",
  "qoute": "Вы властны над своим разумом, но не над внешними событиями. Когда вы поймёте это, вы обретёте силу."
  },
  {"autor": "Энтони Хоар",
   "qoute": "Есть два способа построения программ: сделать их настолько простыми, что там очевидно не будет ошибок, или же настолько сложными, что там не будет очевидных ошибок."
  },
  {"autor": "Мастер Юан-Ма",
  "qoute": "Цу-ли и Цу-су похвалялись размерами своих новых программ. 'Двести тысяч строк', - сказал Цу-ли, - 'не считая комментариев!' Цу-су ответил: 'Пф-ф, моя - почти миллион строк'. Мастер Юан-Ма сказал: 'Моя лучшая программа занимает пятьсот строк'. Услышав это, Цу-ли и Цу-су испытали просветление."
  },
  {"autor": "Джейми Завински",
   "qoute": "Некоторые люди, столкнувшись с проблемой, думают: 'О, а использую-ка я регулярные выражения'. Теперь у них две проблемы."
  },
  {"autor": "Мастер Юан-Ма",
   "qoute": "Юан-Ма сказал: 'Требуется большая сила, чтобы резать дерево поперёк структуры древесины. Требуется много кода, чтобы программировать поперёк структуры проблемы'."
  },
  {"autor": "Хэл Абельсон и Жеральд Сасман",
   "qoute": "То, что проверяет и определяет смысл выражений в языке программирования, является в свою очередь просто программой."
  },
  {"autor": "Мастер Юан-Ма",
   "qoute": "Когда ученик спросил учителя о природе цикла Данных и Контроля, Юан-Ма ответил: 'Подумай о компиляторе, компилирующем самого себя'."
  },
  {"autor": "Дуглас Крокфорд",
   "qoute": "Браузер - крайне враждебная программная среда."
  },
  {"autor": "Ийен Бэнкс",
   "qoute": "Вся наша жизнь - игра."
  },
  {"autor": "Тим Бернес-Ли",
   "qoute": "Мечта, ради которой создавалась Сеть - это общее информационное пространство, в котором мы общаемся, делясь информацией. Его универсальность является его неотъемлемой частью: ссылка в гипертексте может вести куда угодно, будь то персональная, локальная или глобальная информация, черновик или выверенный текст."
  },
  {"autor": "Гёте",
   "qoute": "Я нынче ж на ученом кутеже Твое доверье службой завоюю, Ты ж мне черкни расписку долговую, Чтоб мне не сомневаться в платеже."
  },
  {"autor": "Жоан Миро",
   "qoute": "Я смотрю на многообразие цветов. Я смотрю на пустой холст. Затем я пытаюсь нанести цвета как слова, из которых возникают поэмы, как ноты, из которых возникает музыка."
  },
  {"autor": "Мастер Юан-Ма",
   "qoute": "Под поверхностью машины движется программа. Без усилий, она расширяется и сжимается. Находясь в великой гармонии, электроны рассеиваются и собираются. Формы на мониторе - лишь рябь на воде. Суть остаётся скрытой внутри..."
  },
  {"autor": "Мастер Юан-Ма",
   "qoute": "Ученик спросил: 'Программисты встарь использовали только простые компьютеры и программировали без языков, но они делали прекрасные программы. Почему мы используем сложные компьютеры и языки программирования?' Фу-Тзу ответил: 'Строители встарь использовали только палки и глину, но они делали прекрасные хижины'."
  },
  {"autor": "",
   "qoute": ""
  }]
